{
  "sections": {
    "main": {
      "type": "page_careers-role",
      "settings": {
        "title": "Work at Pzaz",
        "location": "New York, NY",
        "headline": "Now hiring a consumer goods aficionado who lives and breath Instagram, TikTok, and Twitter.",
        "about": "<p>Pzaz, Inc. is looking for a Social Media Manager to plan, manage and oversee account activity on our core social channels. The right candidate will have extensive social media experience both personally and professionally and have spent the last 2+ years working for a small consumer goods\/lifestyle brand.<\/p><p><\/p><p>Day-to-day, you will be responsible for managing Pzaz’s TikTok and Instagram, sourcing and uploading content to Pzaz’s feed, engaging with followers and accounts through comments, likes, and follows, as well as identifying potential creators and ambassadors for future paid partnerships.<\/p><p>You should be located in NYC, very comfortable making TikToks and speaking to New York City bodega boys, and exude high-energy. You should be comfortable being in content and on camera. You will work on Twitter as well, and be a core part of the marketing team, building skills across project management, operations, content deliverables and results, benchmarking, and reporting.<\/p>",
        "responsibilities": "<ul><li>Ensure that content is posted on Pzaz’s TikTok and Instagram account in compliance with posting criteria.<\/li><\/ul><p><\/p><ul><li>Create multiple pieces of content for TikTok every day.<\/li><\/ul><p><\/p><ul><li>Grow our audiences, and keep them entertained and educated on the next generation of on-the-go energy by posting to our feed and stories daily.<\/li><\/ul><p><\/p><ul><li>Engage with followers and other creators by leaving comments on other videos in the platform.<\/li><\/ul><p><\/p><ul><li>Maintain & Organize Pzaz’s Content Bank for seamless asset collection and sharing across departments, projects, and campaigns.<\/li><\/ul><p><\/p><ul><li>Source Images & Video to be used in a variety of posts ranging from Educational & Informative to Vibe Checks & Moodboards.<\/li><\/ul><p><\/p><ul><li>Plan, coordinate, manage, and execute 30+ posts monthly.Assist our Marketing Lead by creating Monthly Content Calendars.<\/li><\/ul><p><\/p><ul><li>Provide accurate reporting on our Social Metrics using our Social Reporting Dashboard to track Followers, Impressions, Account Engagement, Drive to Website, and Reach.<\/li><\/ul>",
        "qualifications": "<ul><li>2+ years of experience working in marketing and\/or communications position<\/li><\/ul><p><\/p><ul><li>Bachelor’s Degree in related field, preferably Marketing, Advertising, Journalism or Social Media Management<\/li><\/ul><p><\/p><ul><li>Excellent communication, organizational and writing skills<\/li><\/ul><p><\/p><ul><li>Comprehensive understanding of social media platforms, affiliate programs, content editing applications, and other best practices<\/li><\/ul><p><\/p><ul><li>Ability to manage multiple projects simultaneously<\/li><\/ul><p><\/p><ul><li>Extreme comfort with TikTok, its trends, and how to make cutting edge content in and out of the app itself.<\/li><\/ul><p><\/p><ul><li>Knowledge and enthusiasm for the Instagram platform<\/li><\/ul><p><\/p><ul><li>Experience running a brand social media account<\/li><\/ul><p><\/p><ul><li>Experience with early-stage brand development and the frenetic pace of work that comes with it<\/li><\/ul><p><\/p><ul><li>Communication, creativity, and an eye for art direction & social media is a must.<\/li><\/ul>",
        "apply": "Email careers@pzaz.com with a relevant CV and interest."
      }
    }
  },
  "order": [
    "main"
  ]
}